In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
x = Series({"A":2, "B":3})
y1 = Series({"A":10, "B":100})
y2 = Series({"B":100, "A":10})
x

A    2
B    3
dtype: int64

In [4]:
y1

A     10
B    100
dtype: int64

In [5]:
y2

B    100
A     10
dtype: int64

In [6]:
x * y1  # what is it????

A     20
B    300
dtype: int64

In [7]:
x * y2

A     20
B    300
dtype: int64

In [8]:
x = Series({"A":2, "B":3})
y1 = Series({"A":10, "B":100})
y2 = Series({"B":100, "A":10})

In [9]:
y1 > x

A    True
B    True
dtype: bool

In [10]:
# y2 > x  # not previously aligned
y2.gt(x)

A    True
B    True
dtype: bool

In [11]:
x.sort_index() < y2.sort_index()

A    True
B    True
dtype: bool

In [12]:
col1 = Series(["Alice", "Bob", "Cindy", "Dan"])
col2 = Series([5,6,7,8])
DataFrame({"name":col1, "score":col2})

    name  score
0  Alice      5
1    Bob      6
2  Cindy      7
3    Dan      8

In [13]:
d = DataFrame({"name":["Alice", "Bob", "Cindy", "Dan"],
               "score":[5,6,7,8]}, index=["A", "B", "C", "D"])
d

    name  score
A  Alice      5
B    Bob      6
C  Cindy      7
D    Dan      8

In [14]:
# FOR Series:
# s.loc[X]    <- look up by index
# s.iloc[X]   <- look up by int pos
# s[X]        <- depends (try index first)

# FOR DataFrame:
# d.loc[X]    <- look up row by row index
# d.iloc[X]   <- look up row by row int pos
# d[X]        <- look up col by col index

In [15]:
d.loc["A"]

name     Alice
score        5
Name: A, dtype: object

In [16]:
d.iloc[-1]

name     Dan
score      8
Name: D, dtype: object

In [17]:
d

    name  score
A  Alice      5
B    Bob      6
C  Cindy      7
D    Dan      8

In [18]:
d["name"]

A    Alice
B      Bob
C    Cindy
D      Dan
Name: name, dtype: object

In [19]:
d["score"]

A    5
B    6
C    7
D    8
Name: score, dtype: int64

In [20]:
d["score"]["B"] # shorthand for d["score"].loc["B"]

6

In [21]:
d.iloc[-2,-1] # last cell of next-to-last row

7

In [22]:
d

    name  score
A  Alice      5
B    Bob      6
C  Cindy      7
D    Dan      8

In [23]:
d.loc["A", "score"]

5

In [24]:
d.loc["A", "score"] = 1
d

    name  score
A  Alice      1
B    Bob      6
C  Cindy      7
D    Dan      8

In [25]:
d.iloc[1:-1, :]

    name  score
B    Bob      6
C  Cindy      7

In [26]:
d.loc["B":"C", :] # woah!  just learned that slice ends are inclusive with .loc.  Why????

    name  score
B    Bob      6
C  Cindy      7

In [27]:
d.iloc[1:-1, -1] += 10
d

    name  score
A  Alice      1
B    Bob     16
C  Cindy     17
D    Dan      8

In [28]:
d["score"].mean()

10.5

In [29]:
b = d["score"] > d["score"].mean()
b

A    False
B     True
C     True
D    False
Name: score, dtype: bool

In [30]:
# d[single value] <- pull out a column
# d[bool series]  <- do boolean indexing over rows

d[b]

    name  score
B    Bob     16
C  Cindy     17

In [31]:
d # want everybody above average

    name  score
A  Alice      1
B    Bob     16
C  Cindy     17
D    Dan      8

In [32]:
d[d["score"] > d["score"].mean()]

    name  score
B    Bob     16
C  Cindy     17

In [33]:
# CSV files

In [34]:
df = pd.read_csv("IMDB-Movie-Data.csv")
df.head(3)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M

In [35]:
df["Year"].head()

0    2014
1    2012
2    2016
3    2016
4    2016
Name: Year, dtype: int64

In [36]:
# what is is the highest rated movie that is under 90 minutes

In [37]:
short = df[df["Runtime"] < 90]
short.head(3)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
7,7,Mindhorn,Comedy,Sean Foley,"Essie Davis, Andrea Riseborough, Julian Barrat...",2016,89,6.4,0
15,15,The Secret Life of Pets,"Animation,Adventure,Comedy",Chris Renaud,"Louis C.K., Eric Stonestreet, Kevin Hart, Lake...",2016,87,6.6,368.31
25,25,Paris pieds nus,Comedy,Dominique Abel,"Fiona Gordon, Dominique Abel,Emmanuelle Riva, ...",2016,83,6.8,0

In [38]:
max_rating = short["Rating"].max()
max_rating

7.8

In [39]:
short[short["Rating"] == max_rating]

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
792,792,Ma vie de Courgette,"Animation,Comedy,Drama",Claude Barras,"Gaspard Schlatter, Sixtine Murat, Paulin Jacco...",2016,66,7.8,0.29
813,813,Fantastic Mr. Fox,"Animation,Adventure,Comedy",Wes Anderson,"George Clooney, Meryl Streep, Bill Murray, Jas...",2009,87,7.8,21

In [40]:
stats = df.describe()
stats

            Index         Year     Runtime      Rating
count  998.000000   998.000000  998.000000  998.000000
mean   498.500000  2012.779559  113.170341    6.723447
std    288.242086     3.207549   18.828877    0.945682
min      0.000000  2006.000000   66.000000    1.900000
25%    249.250000  2010.000000  100.000000    6.200000
50%    498.500000  2014.000000  111.000000    6.800000
75%    747.750000  2016.000000  123.000000    7.400000
max    997.000000  2016.000000  191.000000    9.000000

In [41]:
# want mean runtime
stats.loc["mean", "Runtime"]

113.17034068136273